{
    "101": {
        "name": "First Formation!",
        "desc": "บรรจุ 2 ships ใน กองเรือหลัก."
    },
    "102": {
        "name": "จัด  Destroyer ชุดเรือ!",
        "desc": "บรรจุ 4 เรือพิฆาต (DD) ใน กองเรือหลัก."
    },
    "103": {
        "name": "จัด  Torpedo ชุดเรือ!",
        "desc": "บรรจุ  เรือลาดตระเวนเบา (CL) as  เรือธง และ 5 เรือพิฆาต (DD) ใน กองเรือหลัก."
    },
    "104": {
        "name": "จัด  Six Ship กองเรือ!",
        "desc": "บรรจุ 6 ships ใน กองเรือหลัก."
    },
    "105": {
        "name": "จัด  ชุดเรือ โดยมี Two เรือลาดตระเวนเบา (CL)!",
        "desc": "บรรจุ 2 เรือลาดตระเวนเบา (CL) ใน กองเรือหลัก."
    },
    "106": {
        "name": "จัด  Heavy Cruiser ชุดเรือ!",
        "desc": "บรรจุ 2 เรือลาดตระเวนหนัก (CA) ใน กองเรือหลัก."
    },
    "107": {
        "name": "จัด  Carrier Task Force!",
        "desc": "บรรจุ เรือบรรทุกเครื่องบินมาตรฐาน (CV) หรือ เรือบรรทุกเครื่องบินเบา (CVL) เป็นเรือธง และเรือพิฆาต (DD) 3 ลำ ในกองเรือหลัก."
    },
    "108": {
        "name": "จัด Tenryuu-ชั้นเรือ!",
        "desc": "บรรจุ Tenryuu (天龍) และ Tatsuta (龍田) ใน กองเรือหลัก."
    },
    "109": {
        "name": "จัด Sendai-ชั้นเรือ!",
        "desc": "บรรจุ Sendai (川内), Jintsuu (神通) และ Naka (那珂) ใน กองเรือหลัก."
    },
    "110": {
        "name": "จัด Myoukou-ชั้นเรือ!",
        "desc": "บรรจุ Myoukou (妙高), Nachi (那智), Ashigara (足柄) และ Haguro (羽黒) ใน กองเรือหลัก."
    },
    "111": {
        "name": "จัด Fusou-ชั้นเรือ!",
        "desc": "บรรจุ Fusou (扶桑) และ Yamashiro (山城) ใน กองเรือหลัก."
    },
    "112": {
        "name": "จัด Ise-ชั้นเรือ!",
        "desc": "บรรจุ Ise (伊勢) และ Hyuuga (日向) ใน กองเรือหลัก."
    },
    "113": {
        "name": "จัด กองเรือหลัก โดยมี เรือประจัญบาน (BB) และ เรือลาดตระเวนหนัก (CA)!",
        "desc": "บรรจุ  เรือประจัญบาน (BB) และ 2 เรือลาดตระเวนหนัก (CA) ใน กองเรือหลัก."
    },
    "114": {
        "name": "จัด Nagumo Task Force!",
        "desc": "บรรจุ ONLY Akagi (赤城), Kaga (加賀), Hiryuu (飛龍) และ Souryuu (蒼龍) ใน กองเรือหลัก."
    },
    "115": {
        "name": "จัดตั้งกองเรือที่สอง!",
        "desc": "บรรจุ  เรือธง ใน กองเรือที่สอง."
    },
    "116": {
        "name": "Ready  Seaplane Tender",
        "desc": "บรรจุ   เรือบรรทุกเครื่องบินทะเล (AV) ใน กองเรือหลัก."
    },
    "117": {
        "name": "จัด  Carrier Task Force in the กองเรือที่สอง!",
        "desc": "บรรจุ  เรือบรรทุกเครื่องบินมาตรฐาน (CV)\/เรือบรรทุกเครื่องบินเบา (CVL) และ 3 เรือพิฆาต (DD) ใน กองเรือที่สอง."
    },
    "118": {
        "name": "จัด Kongou-ชั้นเรือ!",
        "desc": "บรรจุ Kongou (金剛), Hiei (比叡), Haruna (榛名) และ Kirishima (霧島) ใน กองเรือหลัก."
    },
    "119": {
        "name": "จัด Mikawa กองเรือ!",
        "desc": "บรรจุ Choukai (鳥海), Aoba (青葉), Kako (加古), Furutaka (古鷹), Tenryuu (天龍) และ  FAST speed ship ใน กองเรือหลัก."
    },
    "120": {
        "name": "จัด กองเรือพิฆาตที่ 6!",
        "desc": "บรรจุ ONLY Akatsuki (暁), Hibiki (響), Inazuma (雷) และ Ikazuchi (電) ใน กองเรือหลัก."
    },
    "121": {
        "name": "จัด Cruiser Division 4!",
        "desc": "บรรจุ Atago (愛宕), Takao (高雄), Choukai (鳥海) และ Maya (摩耶) ใน กองเรือหลัก."
    },
    "122": {
        "name": "จัด Nishimura กองเรือ!",
        "desc": "บรรจุ Fusou (扶桑), Yamashiro (山城), Mogami (最上) และ Shigure (時雨) ใน กองเรือหลัก."
    },
    "123": {
        "name": "จัด Carrier Division 5!",
        "desc": "บรรจุ Shoukaku (翔鶴), Zuikaku (瑞鶴) และ 2 เรือพิฆาต (DD) ใน กองเรือหลัก."
    },
    "124": {
        "name": "จัด New Mikawa กองเรือ!",
        "desc": "บรรจุ Choukai (鳥海), Aoba (青葉), Kinugasa (衣笠), Kako (加古), Furutaka (古鷹) และ Tenryuu (天龍) ใน กองเรือหลัก."
    },
    "125": {
        "name": "จัด  เรือดำน้ำ กองเรือ!",
        "desc": "บรรจุ 2 เรือดำน้ำ (SS) ใน กองเรือหลัก."
    },
    "126": {
        "name": "จัด  Naval Aviation Strike กองเรือ!",
        "desc": "บรรจุ 2 เรือประจัญบานบรรทุกเครื่องบิน (BBV) และ 2 เรือลาดตระเวนบรรทุกเครื่องบิน (CAV) ใน กองเรือหลัก."
    },
    "127": {
        "name": "จัด  Medium-Sized เรือดำน้ำ กองเรือ!",
        "desc": "บรรจุ 3 เรือดำน้ำ (SS) ใน กองเรือหลัก."
    },
    "128": {
        "name": "จัด Cruiser Division 6!",
        "desc": "บรรจุ Furutaka (古鷹), Kako(加古), Aoba (青葉) และ Kinugasa (衣笠) ใน กองเรือหลัก."
    },
    "129": {
        "name": "จัด 5th กองเรือ!",
        "desc": "บรรจุ Nachi (那智), Ashigara (足柄), Tama (多摩), และ Kiso (木曾) ใน กองเรือ."
    },
    "130": {
        "name": "จัด Torpedo ชุดเรือ 1!",
        "desc": "บรรจุ Abukuma (阿武隈), Akebono (曙), Ushio (潮), Kasumi (霞) และ Shiranui (不知火) ใน กองเรือ."
    },
    "131": {
        "name": "จัด กองเรือพิฆาตที่ 8!",
        "desc": "บรรจุ Asashio (朝潮), Michishio (満潮), Ooshio (大潮) และ Arashio (荒潮) ใน กองเรือ."
    },
    "132": {
        "name": "จัด กองเรือพิฆาตที่ 18!",
        "desc": "บรรจุ ONLY Kasumi (霞), Arare (霰), Kagerou (陽炎) และ Shiranui (不知火) ใน กองเรือ."
    },
    "133": {
        "name": "จัด กองเรือพิฆาตที่ 30 (Gen-1)!",
        "desc": "บรรจุ ONLY Mutsuki (睦月), Kisaragi (如月), Yayoi (弥生) และ Mochizuki (望月) ใน กองเรือ."
    },
    "134": {
        "name": "In Preparation of Love! (Part 3)",
        "desc": "Organize your feelings และ ส่ง your กองเรือ โดยมี  high level เรือธง (Lv.90~99)!"
    },
    "135": {
        "name": "Journey Anew!",
        "desc": "Organize  กองเรือ of 6 ships โดยมี your newly bonded ship of Lv.100 หรือ more as เรือธง!"
    },
    "136": {
        "name": "จัด 30th Destroyer กองเรือ (รุ่นที่2)",
        "desc": "บรรจุ only Mutsuki (睦月), Yayoi (弥生), Uzuki (卯月) และ Mochizuki (望月) ใน กองเรือ."
    },
    "137": {
        "name": "จัดกองเรือลาดตระเวนที่ 5",
        "desc": "บรรจุ Myoukou (妙高), Nachi (那智) และ Haguro (羽黒) ใน กองเรือ."
    },
    "138": {
        "name": "จัด new 2nd Carrier Division",
        "desc": "บรรจุ Hiryuu Kai Ni (飛龍改二, as the เรือธง), Souryuu (蒼龍) และ 2 destroyers ใน กองเรือ."
    },
    "139": {
        "name": "จัด 6th เรือดำน้ำ กองเรือ",
        "desc": "บรรจุ  เรือดำน้ำ tender และ 4 (หรือ more) submarines ใน กองเรือ."
    },
    "140": {
        "name": "Test the new RADAR!",
        "desc": "บรรจุ Myoukou Kai2 as the เรือธง of your กองเรือ."
    },
    "141": {
        "name": "Reorganise the Strengthened 2nd Carrier Division",
        "desc": "บรรจุ Souryuu Kai-2 (蒼龍改二) as เรือธง โดยมี Hiryuu Kai-2 (飛龍改二) และ 2 destroyers ใน กองเรือ."
    },
    "142": {
        "name": "Organise the Elite 3rd Battleship Division",
        "desc": "บรรจุ all four Kongou-ชั้นเรือ Kai 2 battleships ใน กองเรือหลัก."
    },
    "143": {
        "name": "ส่ง  New Standard Aircraft Carrier",
        "desc": "บรรจุ Unryuu (雲龍) as your เรือธง."
    },
    "144": {
        "name": "Organise the Main Battleship กองเรือ: the 2nd ชุดเรือ",
        "desc": "บรรจุ both Nagato-ชั้นเรือ และ both Fusou-ชั้นเรือ battleships (และ no other ships) ใน กองเรือหลัก."
    },
    "145": {
        "name": "Organise the Main Battleship Force",
        "desc": "บรรจุ three battleships of Nagato, Fusou, Ise หรือ Yamato classes และ  light cruiser ใน กองเรือ."
    },
    "146": {
        "name": "Prepare the Arsenal for Renovations",
        "desc": "บรรจุ Akashi (明石) as your เรือธง ใน กองเรือหลัก."
    },
    "147": {
        "name": "Organise the Nishimura กองเรือ",
        "desc": "บรรจุ Fusou (扶桑), Yamashiro (山城), Mogami (最上), Shigure (時雨) และ Michishio (満潮) ใน กองเรือหลัก."
    },
    "148": {
        "name": "Organise the Counterattack ชุดเรือ",
        "desc": "บรรจุ Kasumi (霞) as the เรือธง, Ashigara (足柄), 1 เรือลาดตระเวนเบา (CL) และ 3 more DDs ใน กองเรือหลัก."
    },
    "149": {
        "name": "Organise the 11th กองเรือพิฆาตที่",
        "desc": "บรรจุ the 4 Special-type destroyers: Fubuki (吹雪), Shirayuki(白雪), Hatsuyuki (初雪) และ Murakumo(叢雲) ใน กองเรือหลัก. One of them should be the เรือธง."
    },
    "150": {
        "name": "Organise the 21st กองเรือพิฆาตที่",
        "desc": "บรรจุ only Hatsuharu (初春), Nenohi (子日), Wakaba (若葉) และ Hatsushimo (初霜) ใน กองเรือหลัก."
    },
    "151": {
        "name": "Organise the 22nd กองเรือพิฆาตที่",
        "desc": "บรรจุ only Satsuki (皐月), Fumizuki (文月), Nagatsuki (長月) และ 1 more เรือพิฆาต (DD) ใน กองเรือหลัก."
    },
    "152": {
        "name": "Organise the New Edition of the Mikawa กองเรือ",
        "desc": "บรรจุ Choukai Kai2 as the เรือธง และ any five of Aoba, Kinugasa, Kako, Furutaka, Tenryuu, Yuubari ใน กองเรือหลัก"
    },
    "153": {
        "name": "Reorganize the 18th ชุดเรือ!",
        "desc": "บรรจุ Tenryuu, Tatsuta และ 2 หรือ more other ships ใน กองเรือ"
    },
    "154": {
        "name": "Organize the surface attack กองเรือ!",
        "desc": "บรรจุ Hiei, Kirishima, Nagara, Akatsuki, Ikazuchi, Inazuma ใน กองเรือ"
    },
    "155": {
        "name": "Organize the new 6th กองเรือพิฆาตที่!",
        "desc": "บรรจุ Akatsuki Kai2 as เรือธง โดยมี Hibiki/Bep, Ikazuchi, Inazuma ใน กองเรือ"
    },
    "156": {
        "name": "1st Torpedo ชุดเรือ, Prepare for  Rush ที่ the Northern Sea",
        "desc": "บรรจุ Abukuma as เรือธง โดยมี Hibiki/Вер, Hatsushimo, Wakaba, Samidare และ Shimakaze ใน กองเรือหลัก"
    },
    "157": {
        "name": "1st Torpedo ชุดเรือ, Prepare for Another Rush ที่ the Northern Sea",
        "desc": "บรรจุ Abukuma Kai Ni as เรือธง โดยมี Hibiki/Вер, Yuugumo, Naganami, Akigumo และ Shimakaze ใน กองเรือหลัก"
    },
    
    
    
    "202": {
        "name": "First ออกรบ!",
        "desc": "ส่ง your กองเรือหลัก on  combat mission."
    },
    "203": {
        "name": "Protect the Seas of Chinju-Fu!",
        "desc": "ส่ง ที่ เวิร์ล 1-1 และ clear the stage."
    },
    "204": {
        "name": "ออกรบไปยัง the Coast of Nansei Islands!",
        "desc": "ส่ง ที่ เวิร์ล 1-2 และ clear the stage."
    },
    "205": {
        "name": "Intercept Approaching Enemy Vanguard กองเรือ!",
        "desc": "ส่ง ที่ เวิร์ล 1-2 after defeating its บอส และ clear the stage."
    },
    "206": {
        "name": "ออกรบ the Torpedo ชุดเรือ!",
        "desc": "ส่ง  กองเรือ โดยมี  เรือลาดตระเวนเบา (CL) as เรือธง และ 3 เรือพิฆาต (DD) as escorts."
    },
    "207": {
        "name": "ออกรบ  Heavy Cruiser!",
        "desc": "ส่ง  กองเรือ โดยมี  เรือลาดตระเวนหนัก (CA) เป็น เรือธง."
    },
    "208": {
        "name": "ออกรบ  Battleship!",
        "desc": "ส่ง  กองเรือ โดยมี  เรือประจัญบาน (BB) เป็น เรือธง. เรือประจัญบานบรรทุกเครื่องบิน (BBV) don't count."
    },
    "209": {
        "name": "ออกรบ  Carrier Task Force!",
        "desc": "Deply  กองเรือ โดยมี เรือบรรทุกเครื่องบินมาตรฐาน (CV)(L) as เรือธง และ 5 เรือพิฆาต (DD)\/เรือลาดตระเวนเบา (CL)\/เรือบรรทุกเครื่องบินทะเล (AV) for the escorts."
    },
    "215": {
        "name": "กองเรือที่สอง ออกรบ!",
        "desc": "ส่ง your 2nd กองเรือ on  combat mission."
    },
    "217": {
        "name": "จม Enemy Carrier!",
        "desc": "จม   enemy aircraft carrier."
    },
    "219": {
        "name": "ออกรบ the Mikawa กองเรือ!",
        "desc": "บรรจุ  กองเรือ โดยมี Choukai, Aoba, Kako, Furutaka, Tenryuu และ another fast ship."
    },
    "222": {
        "name": "ออกรบ the กองเรือพิฆาตที่ 6!",
        "desc": "บรรจุ  กองเรือ โดยมี ONLY Akatsuki, Hibiki, Inazuma, และ Ikazuchi."
    },
    "223": {
        "name": "ออกรบ the Cruiser Division 4!",
        "desc": "บรรจุ  กองเรือ โดยมี Atago, Takao, Choukai, Maya และ any 2 ships. Score  victory against เวิร์ล 2-2 บอส."
    },
    "224": {
        "name": "ออกรบ the Nishimura กองเรือ!",
        "desc": "บรรจุ  กองเรือ โดยมี Fusou, Yamashiro, Mogami, Shigure และ any 2 ships. Score  victory against เวิร์ล 2-3 บอส."
    },
    "225": {
        "name": "ออกรบ the Carrier Division 5!",
        "desc": "บรรจุ  กองเรือ โดยมี Shoukaku, Zuikaku และ any 4 ships. Score  victory against เวิร์ล 3-1 บอส."
    },
    "227": {
        "name": "ออกรบ the New Mikawa กองเรือ!",
        "desc": "บรรจุ  กองเรือ โดยมี Choukai, Aoba, Kinugasa, Kako, Furutaka และ Tenryuu. Score  victory against เวิร์ล 2-3 บอส."
    },
    "231": {
        "name": "ออกรบ  เรือดำน้ำ กองเรือ!",
        "desc": "บรรจุ  กองเรือ โดยมี 2 เรือดำน้ำ (SS) และ 4 additional ships. Score  victory against เวิร์ล 2-3 บอส."
    },
    "232": {
        "name": "ออกรบ  Naval Aviation Strike กองเรือ!",
        "desc": "บรรจุ  กองเรือ โดยมี 2 เรือประจัญบานบรรทุกเครื่องบิน (BBV), 2 เรือลาดตระเวนบรรทุกเครื่องบิน (CAV) และ 2 additional ships. Score  victory against เวิร์ล 4-2 บอส."
    },
    "233": {
        "name": "ออกรบ the Cruiser Division 6!",
        "desc": "บรรจุ  กองเรือ โดยมี Furutaka, Kako, Kinugasa, Aoba และ 2 additional ships. Score  S rank victory against เวิร์ล 2-3 บอส."
    },
    "239": {
        "name": "ออกรบ the กองเรือพิฆาตที่ 8!",
        "desc": "บรรจุ  กองเรือ โดยมี Asashio, Michishio, Ooshio, Arashio และ 2 additional ships. Score  victory against เวิร์ล 2-3 บอส."
    },
    "240": {
        "name": "ออกรบ the กองเรือพิฆาตที่ 18!",
        "desc": "บรรจุ  กองเรือ โดยมี Kasumi, Arare, Kagerou, Shiranui และ 2 additional ships. Score  victory against เวิร์ล 3-1 บอส."
    },
    "244": {
        "name": "ส่ง the กองเรือพิฆาตที่ 30 (Gen-1)",
        "desc": "บรรจุ  กองเรือ that consists of Mutsuki (睦月), Kisaragi (如月), Yayoi (弥生), Mochizuki (望月) และ up ที่ 2 additional DDs ที่ เวิร์ล 3-2 และ encounter the บอส. C rank หรือ above is required."
    },
    "245": {
        "name": "In Preparation of Love! (Final)",
        "desc": "บรรจุ  กองเรือ โดยมี  high level (Lv.90~99) เรือธง ที่ 2-3 obtain   S rank victory against the บอส."
    },
    "246": {
        "name": "Your First Mission Together!",
        "desc": "บรรจุ  กองเรือ ที่ 4-3 โดยมี  bonded ship of Lv.100 หรือ more as เรือธง และ score   S rank victory against the บอส."
    },
    "247": {
        "name": "ออกรบ   aviation battleship กองเรือ!",
        "desc": "บรรจุ 2 เรือประจัญบานบรรทุกเครื่องบิน (BBV) ships ใน กองเรือหลัก และ score  victory against เวิร์ล 4-4 บอส."
    },
    "248": {
        "name": "30th Destroyer กองเรือ's Anti-เรือดำน้ำ Patrol",
        "desc": "บรรจุ Mutsuki, Yayoi, Uzuki และ Mochizuki ที่ เวิร์ล 1-5 และ reach the บอส, scoring at least  C rank."
    },
    "250": {
        "name": "ส่ง the 2nd Carrier Division",
        "desc": "บรรจุ Hiryuu Kai Ni (飛龍改二) as the เรือธง, Souryuu (蒼龍) และ two destroyers ที่ เวิร์ล 5-2. You may add 2 other ships. Score   S rank victory against the บอส."
    },
    "251": {
        "name": "ส่ง the Elite 2nd Carrier Division",
        "desc": "บรรจุ Souryuu Kai Ni (蒼龍改二) as the เรือธง, Hiryuu Kai Ni (飛龍改二) และ two destroyers ที่ เวิร์ล 4-3. You may add 2 other ships. Score   S rank victory against the บอส."
    },
    "252": {
        "name": "ส่ง  Haruna-led กองเรือ",
        "desc": "บรรจุ  กองเรือ โดยมี Haruna Kai Ni (榛名改二) as the เรือธง และ up ที่ 5 additional ships ที่ เวิร์ล 5-1 และ score   S rank victory against the บอส."
    },
    "253": {
        "name": "ส่ง the 601 Air Group",
        "desc": "บรรจุ  กองเรือ โดยมี Unryuu Kai (雲龍改) as the เรือธง ที่ เวิร์ล 5-2 และ score   S rank victory against the บอส."
    },
    "254": {
        "name": "ส่ง  Light Carrier ชุดเรือ",
        "desc": "บรรจุ  กองเรือ of 1-2 light aircraft carriers, 1 light cruiser และ 3-4 destroyers ที่ เวิร์ล 2-1 และ score   S rank victory against the บอส."
    },
    "255": {
        "name": "ส่ง  Torpedo ชุดเรือ ที่ Bashi Islands",
        "desc": "บรรจุ  กองเรือ of 1-2 light cruisers (โดยมี one of them as the เรือธง) และ 4-5 destroyers ที่ เวิร์ล 2-2. Score  victory at the บอส และ จม the enemy เรือธง."
    },
    "258": {
        "name": "ออกรบ the 2nd ชุดเรือ",
        "desc": "บรรจุ Nagato (長門), Mutsu (陸奥), Fusou (扶桑), Yamashiro (山城) และ up ที่ 2 additional ships ที่ เวิร์ล 4-2. Score two S rank victories at the บอส node."
    },
    "260": {
        "name": "ส่ง the Battleship ชุดเรือ in the Northern Waters",
        "desc": "บรรจุ two battleships,  light aircraft carrier และ up ที่ three additional ships ที่ เวิร์ล 3-5 และ score   S rank victory at the บอส node."
    },
    "262": {
        "name": "ส่ง the Nishimura กองเรือ in the Southern Waters",
        "desc": "บรรจุ Fusou (扶桑), Yamashiro (山城), Mogami (最上), Shigure (時雨) และ Michishio (満潮) (you may also add another ship) ที่ เวิร์ล 5-1 และ score   S rank victory at the บอส node."
    },
    "263": {
        "name": "ส่ง the Sixth ชุดเรือ ที่ the Southwestern Waters",
        "desc": "บรรจุ Furutaka (古鷹), Kako (加古), Aoba (青葉), Kinugasa (衣笠) และ up ที่ two additional ships ที่ เวิร์ล 2-5 และ score   S rank victory at the บอส node."
    },
    "267": {
        "name": "ส่ง the 11th กองเรือพิฆาตที่",
        "desc": "บรรจุ Fubuki (吹雪), Shirayuki(白雪), Hatsuyuki (初雪), Murakumo(叢雲) และ up ที่ 2 additional ships ที่ เวิร์ล 2-3 และ score  victory at the บอส node."
    },
    "268": {
        "name": "11th กองเรือพิฆาตที่'s Anti-เรือดำน้ำ Patrol",
        "desc": "บรรจุ Fubuki (吹雪), Shirayuki(白雪), Hatsuyuki (初雪) และ Murakumo(叢雲) ที่ เวิร์ล 1-5 และ get  score of at least C at the บอส node."
    },
    "269": {
        "name": "ส่ง the 21st กองเรือพิฆาตที่",
        "desc": "บรรจุ Hatsuharu (初春), Nenohi (子日), Wakaba (若葉) และ Hatsushimo (初霜) และ up ที่ 2 additional ships ที่ เวิร์ล 3-1 และ score   S rank victory at the บอส node."
    },
    "270": {
        "name": "ส่ง the 22nd กองเรือพิฆาตที่",
        "desc": "บรรจุ Satsuki (皐月), Fumizuki (文月), Nagatsuki (長月), 1 more เรือพิฆาต (DD) และ up ที่ two additional ships ที่ เวิร์ล 1-4 และ score   S rank victory at the บอส node."
    },
    "271": {
        "name": "ส่ง Nachi's ชุดเรือ",
        "desc": "บรรจุ  กองเรือ โดยมี Nachi (那智) as เรือธง, Hatsushimo (初霜), Kasumi (霞), Ushio (潮), Akebono (曙) และ one additional ship ที่ เวิร์ล 2-2 และ score   S rank victory at the บอส node."
    },
    "272": {
        "name": "ส่ง the Remodelled Anti-Aircraft Heavy Cruiser",
        "desc": "บรรจุ  กองเรือ โดยมี Maya (摩耶) Kai หรือ Kai2, 1 เรือลาดตระเวนเบา (CL), 2 เรือพิฆาต (DD) และ up ที่ two additional ships ที่ เวิร์ล 2-3 และ score   S rank victory at the บอส node."
    },
    "273": {
        "name": "ส่ง the Mikawa กองเรือ ที่ Solomon Islands",
        "desc": "บรรจุ the กองเรือหลัก โดยมี Choukai Kai2 as the เรือธง และ any five of Aoba, Kinugasa, Kako, Furutaka, Tenryuu, Yuubari ที่ 5-1 และ S-Rank the บอส"
    },
    "274": {
        "name": "6th กองเรือพิฆาตที่'s Anti-เรือดำน้ำ Patrol",
        "desc": "บรรจุ Akatsuki, Hibiki (響 หรือ Верный), Inazuma และ Ikazuchi ที่ 1-5. C-Rank+ the บอส"
    },
    "275": {
        "name": "ส่ง the 18th ชุดเรือ",
        "desc": "บรรจุ Tenryuu, Tatsuta, และ at least 2 other ships ที่ [W2-3] และ S-rank the บอส node"
    },
    "276": {
        "name": "ออกรบ the surface attack กองเรือ!",
        "desc": "บรรจุ Hiei, Kirishima, Nagara, Akatsuki, Ikazuchi, Inazuma ที่ 5-1 และ clear the map โดยมี   S-rank"
    },
    "277": {
        "name": "DesDiv6 Anti-เรือดำน้ำ Mission!",
        "desc": "บรรจุ Akatsuki Kai2 , Hibiki/Verniy, Ikazuchi, Inazuma ที่ 1-5 และ clear the map โดยมี at least -rank"
    },
    "278": {
        "name": "Rush the 1st Torpedo ชุดเรือ ที่ Operation KE",
        "desc": "บรรจุ Abukuma as เรือธง โดยมี Hibiki/Вер, Hatsushimo, Wakaba, Samidare และ Shimakaze ที่ 3-2 และ B-Rank+ the บอส"
    },
    "279": {
        "name": "Rush the 1st Torpedo ชุดเรือ ที่ Operation KE Again",
        "desc": "บรรจุ Abukuma Kai-2 as เรือธง โดยมี Hibiki/Вер, Yuugumo, Naganami, Akigumo และ Shimakaze ที่ 3-2 และ B-Rank+ the บอส"
    },
    
    
    
    "201": {
        "code": "Bd1",
        "name": "ดำเนินการออกรบประจำวัน #1",
        "desc": "ชนะกองเรือน้ำลึก 1 ครั้ง",
        "unlock": [ 216, 211, 212 ],
        "tracking": [ [0,1] ]
    },
    "216": {
        "code": "Bd2",
        "name": "ดำเนินการออกรบประจำวัน #2",
        "desc": "ชนะเรือธงของกองเรือน้ำลึก 1 ครั้ง",
        "unlock": [ 210, 218, 214, 213 ],
        "tracking": [ [0,1] ]
    },
    "210": {
        "code": "Bd3",
        "name": "ดำเนินการออกรบประจำวัน #3",
        "desc": "ชนะกองเรือน้ำลึก 10 ครั้ง (B-rank ขึ้นไป)",
        "tracking": [ [0,10] ]
    },
    "211": {
        "code": "Bd4",
        "name": "ดำเนินการออกรบประจำวัน #4",
        "desc": "จมเรือบรรทุกเครื่องบินน้ำลึก 3 ลำ (CV)(L)",
        "tracking": [ [0,3] ]
    },
    "218": {
        "code": "Bd5",
        "name": "ดำเนินการออกรบประจำวัน #5",
        "desc": "จมเรือขนส่งน้ำลึก 3 ลำ",
        "unlock": [ 226, 220 ],
        "tracking": [ [0,3] ]
    },
    "212": {
        "code": "Bd6",
        "name": "ดำเนินการออกรบประจำวัน #6",
        "desc": "จมเรือขนส่งน้ำลึก 5 ลำ",
        "tracking": [ [0,5] ]
    },
    "226": {
        "code": "Bd7",
        "name": "ดำเนินการออกรบประจำวัน #7",
        "desc": "ชนะบอสใน [W2] เป็นจำนวน 5 ครั้ง",
        "unlock": [ 230 ],
        "tracking": [ [0,5] ]
    },
    "230": {
        "code": "Bd8",
        "name": "ดำเนินการออกรบประจำวัน #8",
        "desc": "จมเรือดำน้ำน้ำลึก 6 ลำ",
        "tracking": [ [0,6] ]
    },
    
    
    
    
    
    "214": {
        "code": "Bw1",
        "name": "ดำเนินการออกรบประจำสัปดาห์ #1",
        "desc": "ออกรบ 36 ครั้ง, เผชิญหน้าบอส 24 ครั้ง, ชนะบอส 12 ครั้ง, และได้ S-rank 6 ครั้ง",
        "unlock": [ 221 ],
        "tracking": [ [0,36], [0,24], [0,12], [0,6] ]
    },
    "220": {
        "code": "Bw2",
        "name": "ดำเนินการออกรบประจำสัปดาห์ #2",
        "desc": "จมเรือบรรทุกเครื่องบินน้ำลึก (CV)(L) 20 ลำ",
        "unlock": [ 228 ],
        "tracking": [ [0,20] ]
    },
    "213": {
        "code": "Bw3",
        "name": "ดำเนินการออกรบประจำสัปดาห์ #3",
        "desc": "จมเรือขนส่งน้ำลึก 20 ลำ",
        "tracking": [ [0,20] ]
    },
    "221": {
        "code": "Bw4",
        "name": "ดำเนินการออกรบประจำสัปดาห์ #4",
        "desc": "จมเรือขนส่งน้ำลึก 50 ลำ",
        "unlock": [ 261, 257, 264 ],
        "tracking": [ [0,50] ]
    },
    "228": {
        "code": "Bw5",
        "name": "ดำเนินการออกรบประจำสัปดาห์ #5",
        "desc": "จมเรือดำน้ำน้ำลึก 15 ลำ",
        "unlock": [ 229, 241, 613 ],
        "tracking": [ [0,15] ]
    },
    "229": {
        "code": "Bw6",
        "name": "ดำเนินการออกรบประจำสัปดาห์ #6",
        "desc": "ชนะบอสใน [W4] เป็นจำนวน 12 ครั้ง",
        "unlock": [ 242 ],
        "tracking": [ [0,12] ]
    },
    "241": {
        "code": "Bw7",
        "name": "ดำเนินการออกรบประจำสัปดาห์ #7",
        "desc": "ชนะบอสใน [W3-3], [W3-4] หรือ [W3-5] เป็นจำนวน 5 ครั้ง",
        "tracking": [ [0,5] ]
    },
    "242": {
        "code": "Bw8",
        "name": "ดำเนินการออกรบประจำสัปดาห์ #8",
        "desc": "ชนะบอสใน [W4-4]",
        "unlock": [ 243 ],
        "tracking": [ [0,1] ]
    },
    "243": {
        "code": "Bw9",
        "name": "ดำเนินการออกรบประจำสัปดาห์ #9",
        "desc": "ชนะบอสใน [W5-2] ด้วย S-rank เป็นจำนวน 2 ครั้ง",
        "tracking": [ [0,2] ]
    },
    "261": {
        "code": "Bw10",
        "name": "ดำเนินการออกรบประจำสัปดาห์ #10",
        "desc": "ชนะบอสใน [W1-5] ด้วย A-rank ขึ้นไปเป็นจำนวน 3 ครั้ง",
        "tracking": [ [0,3] ]
    },
    
    
    
    
    
    "249": {
        "code": "Bm1",
        "name": "ส่ง the Fifth ชุดเรือ",
        "desc": "บรรจุเรือ Myoukou, Nachi, Haguro, + เรืออื่นๆ 3 ลำ ออกรบไปยัง [W2-5] และชนะบอสด้วย S-rank",
        "unlock": [ 265 ]
    },
    "256": {
        "code": "Bm2",
        "name": "ส่ง  เรือดำน้ำ กองเรือ ที่ เวิร์ล 6-1",
        "desc": "ออกรบไปยัง [W6-1] และชนะบอสด้วย S-rank เป็นจำนวน 3 ครั้ง",
        "tracking": [ [0,3] ]
    },
    "257": {
        "code": "Bm3",
        "name": "ส่ง  Torpedo ชุดเรือ",
        "desc": "บรรจุเรือลาดตระเวนเบา (CL) 1~3 ลำ (โดยมีเรือลาดตระเวนเบา (CL) ลำหนึ่งเป็นเรือธง)  + เรือพิฆาต (DD) 3~5 ลำ ออกรบไปยัง [W1-4] และชนะบอสด้วย S-rank"
    },
    "259": {
        "code": "Bm4",
        "name": "Deploy  Battleship Fleet",
        "desc": "บรรจุเรือประจัญบาน (BB)(V) 2 ลำ + เรือลาดตระเวนเบา (CL) 1 ลำ + เรืออื่นๆ 2 ลำ ออกรบไปยัง [W5-1] และชนะบอสด้วย S-rank"
    },
    "265": {
        "code": "Bm5",
        "name": "Monthly Escort Duty",
        "desc": "ออกรบไปยัง [W1-5] และชนะบอสด้วย A-rank ขึ้นไป 10 ครั้ง",
        "tracking": [ [0,10] ]
    },
    "264": {
        "code": "Bm6",
        "name": "Sortie the Aircraft Carrier Task Force to the West",
        "desc": "บรรจุเรือบรรทุกเครื่องบินมาตรฐาน (CV) 2 ลำ + เรือพิฆาต (DD) 2 ลำ + เรืออื่นๆ 2 ลำ ออกรบไปยัง [W4-2] และชนะบอสด้วย S-rank",
        "unlock": [ 266 ]
    },
    "266": {
        "code": "Bm7",
        "name": "Deploy the Counterattack Fleet",
        "desc": "บรรจุเรือพิฆาต (DD) 4 ลำ (โดยมีเรือพิฆาต (DD) ลำหนึ่งเป็นเรือธง) + เรือลาดตระเวนหนัก (CA) 1 ลำ (ห้ามบรรจุเรือลาดตระเวนบรรทุกเครื่องบิน (CAV)) + เรือลาดตระเวนเบา (CL) 1 ลำ ออกรบไปยัง [W2-5] และชนะบอสด้วย S-rank"
    },
    
    
    
    
    
    "301": {
        "code": "C1",
        "name": "ซ้อมรบครั้งแรก!",
        "desc": "ทำการซ้อมรบ 1 ครั้ง"
    },
    "303": {
        "code": "C2",
        "name": "ดำเนินการซ้อมรบประจำวัน #1",
        "desc": "ทำการซ้อมรบ 3 ครั้ง",
        "unlock": [ 304, 302 ],
        "tracking": [ [0,3] ]
    },
    "304": {
        "code": "C3",
        "name": "ดำเนินการซ้อมรบประจำวัน #2",
        "desc": "ชนะการซ้อมรบ 5 ครั้ง",
        "tracking": [ [0,5] ]
    },
    "302": {
        "code": "C4",
        "name": "ดำเนินการซ้อมรบประจำสัปดาห์",
        "desc": "ชนะการซ้อมรบ 20 ครั้ง",
        "tracking": [ [0,20] ]
    },
    "307": {
        "code": "C5",
        "name": "Improve the Efficiency of the Fleet",
        "desc": "ชนะการซ้อมรบ 3 ครั้งภายในหนึ่งวัน"
    },
    "308": {
        "code": "C6",
        "name": "Improve the Efficiency of the Fleet One More Time",
        "desc": "ชนะการซ้อมรบ 4 ครั้งภายในหนึ่งวัน"
    },
    "309": {
        "code": "C7",
        "name": "Strive to Increase the Level of Training in Preparation for Another Rush at the Northern Sea",
        "desc": "ชนะการซ้อมรบ 4 ครั้งภายในหนึ่งวัน"
    },
    
    
    
    
    "401": {
        "code": "D1",
        "name": "ส่งสำรวจครั้งแรก!",
        "desc": "ส่งสำรวจ 1 ครั้ง"
    },
    "402": {
        "code": "D2",
        "name": "ดำเนินการส่งสำรวจประจำวัน #1",
        "desc": "ส่งสำรวจ 3 ครั้ง",
        "unlock": [ 403 ],
        "tracking": [ [0,3] ]
    },
    "403": {
        "code": "D3",
        "name": "ดำเนินการส่งสำรวจประจำวัน #2",
        "desc": "ส่งสำรวจ 10 ครั้ง",
        "tracking": [ [0,10] ]
    },
    "404": {
        "code": "D4",
        "name": "ดำเนินการส่งสำรวจประจำสัปดาห์ #1",
        "desc": "ส่งสำรวจ 30 ครั้ง",
        "tracking": [ [0,30] ]
    },
    "405": {
        "code": "D5",
        "name": "ปฏิบัติการเรือดำน้ำครั้งแรก!",
        "desc": "ผ่านด่านสำรวจที่ 30"
    },
    "406": {
        "code": "D6",
        "name": "ปฏิบัติการเรือดำน้ำครั้งที่สอง",
        "desc": "ผ่านด่านสำรวจที่ 30 อีก 1 ครั้ง"
    },
    "408": {
        "code": "D7",
        "name": "ปฏิบัติการเรือดำน้ำต่อ",
        "desc": "ผ่านด่านสำรวจที่ 30 อีก 2 ครั้ง"
    },
    "409": {
        "code": "D8",
        "name": "Strategy Meeting โดยมี Overseas เรือดำน้ำ Dispatch!",
        "desc": "ผ่านด่านสำรวจที่ 31"
    },
    "410": {
        "code": "D9",
        "name": "ดำเนินการส่งสำรวจประจำสัปดาห์ #2",
        "desc": "ผ่านด่านสำรวจที่ 37 หรือ 38",
        "unlock": [ 411 ],
        "tracking": [ [0,1] ]
    },
    "412": {
        "code": "D10",
        "name": "Strengthen the Operation of the BBV",
        "desc": "ผ่านด่านสำรวจที่ 23"
    },
    "411": {
        "code": "D11",
        "name": "ดำเนินการส่งสำรวจประจำสัปดาห์ #3",
        "desc": "ผ่านด่านสำรวจที่ 37 หรือ 38 รวมกัน 7 ครั้ง",
        "tracking": [ [0,7] ]
    },
    "413": {
        "code": "D12",
        "name": "Strengthen the Operation of the เรือประจัญบานบรรทุกเครื่องบิน (BBV) (Cont.)",
        "desc": "ผ่านด่านสำรวจที่ 23 อีก 4 ครั้ง"
    },
    "414": {
        "code": "D13",
        "name": "Blue Waters เรือดำน้ำ Operation",
        "desc": "ผ่านด่านสำรวจที่ 39"
    },
    "415": {
        "code": "D14",
        "name": "Blue Waters Extended เรือดำน้ำ Operation",
        "desc": "ผ่านด่านสำรวจที่ 39 อีก 2 ครั้ง"
    },
    "416": {
        "code": "D15",
        "name": "Air Defence Exercises",
        "desc": "ผ่านด่านสำรวจที่ 6 เป็นจำนวน 3 ครั้ง"
    },
    "417": {
        "code": "D16",
        "name": "Deploy the Decoy Task Force",
        "desc": "ผ่านด่านสำรวจที่ 15"
    },
    "418": {
        "code": "D17",
        "name": "Naval Ceremony Preparations",
        "desc": "ผ่านด่านสำรวจที่ 7 เป็นจำนวน 2 ครั้ง"
    },
    "419": {
        "code": "D18",
        "name": "Naval Ceremony",
        "desc": "ผ่านด่านสำรวจที่ 8"
    },
    
    
    
    
    
    "501": {
        "code": "E1",
        "name": "เติมทรัพยากรณ์ครั้งแรก!",
        "desc": "เติมทรัพยากรณ์เรือ"
    },
    "502": {
        "code": "E2",
        "name": "ส่งเรือเข้าอู่ซ่อมเรือครั้งแรก!",
        "desc": "ซ่อมเรือ 1 ลำ"
    },
    "503": {
        "code": "E3",
        "name": "ดำเนินการซ่อมแซมประจำวัน",
        "desc": "ซ่อมเรือ 5 ลำ",
        "unlock": [ 504 ],
        "tracking": [ [0,5] ]
    },
    "504": {
        "code": "E4",
        "name": "ดำเนินการเติมทรัพยากรณ์ประจำวัน",
        "desc": "เติมทรัพยากรณ์เรือ 15 ครั้ง",
        "tracking": [ [0,15] ]
    },
    
    
    
    
    
    "605": {
        "code": "F1",
        "name": "ดำเนินการผลิตยุทโธปกรณ์ #1",
        "desc": "สร้างอุปกรณ์ 1 ครั้ง (ล้มเหลวได้)",
        "unlock": [ 606 ],
        "tracking": [ [0,1] ]
    },
    "606": {
        "code": "F2",
        "name": "ดำเนินการต่อเรือประจำวัน #1",
        "desc": "ต่อเรือ 1 ลำ",
        "unlock": [ 607 ],
        "tracking": [ [0,1] ]
    },
    "607": {
        "code": "F3",
        "name": "ดำเนินการผลิตยุทโธปกรณ์ #2",
        "desc": "สร้างอุปกรณ์ 3 ครั้ง (ล้มเหลวได้)",
        "unlock": [ 608 ],
        "tracking": [ [0,3] ]
    },
     "608": {
        "code": "F4",
        "name": "ดำเนินการต่อเรือประจำวัน #2",
        "desc": "ต่อเรือ 3 ลำ",
        "unlock": [ 609, 619 ],
        "tracking": [ [0,3] ]
    },
     "609": {
        "code": "F5",
        "name": "ดำเนินการรื้อถอนประจำวัน",
        "desc": "ทุบเรือ 2 ลำ",
        "tracking": [ [0,2] ]
    },
    "601": {
        "code": "F6",
        "name": "ต่อเรือครั้งแรก!",
        "desc": "ต่อเรือ 1 ลำ"
    },
    "602": {
        "code": "F7",
        "name": "ผลิตยุทโธปกรณ์ครั้งแรก!",
        "desc": "สร้างอุปกรณ์ 1 ครั้ง"
    },
    "603": {
        "code": "F8",
        "name": "รื้อถอนครั้งแรก!",
        "desc": "ทุบเรือ 1 ลำ"
    },
    "604": {
        "code": "F9",
        "name": "กำจัดยุทโธปกรณ์ครั้งแรก!",
        "desc": "ทุกอุปกรณ์ 1 ครั้ง"
    },
    "610": {
        "code": "F10",
        "name": "การเตรียมการสำหรับการต่อเรือใหญ่ (ส่วนที่ 2)",
        "desc": "ทุบอุปกรณ์ 4 ครั้ง"
    },
    "612": {
        "code": "F11",
        "name": "เตรียม Drum Canister",
        "desc": "ทุบอุปกรณ์ 3 ครั้ง"
    },
     "613": {
        "code": "F12",
        "name": "ดำเนินการกำจัดยุทโธปกรณ์ประจำสัปดาห์",
        "desc": "ทุบอุปกรณ์ 24 ครั้ง",
        "tracking": [ [0,24] ]
    },
     "614": {
        "code": "F13",
        "name": "การแปลงโมเดล 「บรรจุ Tenzan ให้ฝูงบิน Tomonaga」",
        "desc": "บรรจุ เรือธง equipped โดยมี Type 97 Torpedo Bomber (Tomonaga ชุดเรือ), then scrap 2 Tenzan"
    },
    "615": {
        "code": "F14",
        "name": "การแปลงโมเดล 「บรรจุ Suisei ให้ฝูงบิน Egusa」",
        "desc": "บรรจุ เรือธง equipped โดยมี Type 99 Dive Bomber (Egusa ชุดเรือ), then scrap 2 Suisei"
    },
    "616": {
        "code": "F15",
        "name": "การแปลงโมเดล 「บรรจุ Reppuu ให้กลุ่มบินที่ 601」",
        "desc": "บรรจุ เรือธง equipped โดยมี Zero Fighter Type 52 Type C (601 Air Group), then scrap 2 Reppuu"
    },
    "617": {
        "code": "F16",
        "name": "การเตรียมการสำหรับ Irako",
        "desc": "ทุบอุปกรณ์ 10 ครั้ง"
    },
    "618": {
        "code": "F17",
        "name": "พัฒนายุทโธปกรณ์ครั้งแรก!",
        "desc": "พัฒนายุทโธปกรณ์ 1 ครั้ง"
    },
    "619": {
        "code": "F18",
        "name": "ดำเนินการพัฒนายุทโธปกรณ์ประจำวัน",
        "desc": "พัฒนายุทโธปกรณ์ 1 ครั้ง",
        "tracking": [ [0,1] ]
    },
    
    
    
    
    
    "701": {
        "code": "G1",
        "name": "ปรับปรุงเรือครั้งแรก!",
        "desc": "ปรับปรุงเรือ 1 ครั้ง"
    },
    "702": {
        "code": "G2",
        "name": "ดำเนินการปรับปรุงเรือประจำวัน",
        "desc": "ปรับปรุงเรือ 2 ครั้ง",
        "unlock": [ 703 ],
        "tracking": [ [0,2] ]
    },
    "703": {
        "code": "G3",
        "name": "ดำเนินการปรับปรุงเรือประจำสัปดาห์",
        "desc": "ปรับปรุงเรือ 15 ครั้ง",
        "tracking": [ [0,15] ]
    },
    "704": {
        "code": "G4",
        "name": "การเตรียมการสำหรับการต่อเรือใหญ่ (ส่วนที่ 1)",
        "desc": "ปรับปรุงเรือ 4 ครั้ง"
    },
    
    
    
    "611": {
        "name": "เตรียมการแต่งงาน! (ส่วนที่ 1)",
        "desc": "ทุบอุปกรณ์ 2 ครั้ง"
    },
    "306": {
        "name": "เตรียมการแต่งงาน! (ส่วนที่ 2)",
        "desc": "ชนะการซ้อมรบ 2 ครั้ง"
    },
    
    "280": {
        "code": "SN01",
        "name": "Second SN strategy, Initial Operations",
        "desc": "ผ่าน E2"
    },
    "620": {
        "code": "SN02",
        "name": "Tidying Up the Arsenal",
        "desc": "ทุบอุปกรณ์ 5 ครั้ง"
    },
    "281": {
        "code": "SN03",
        "name": "Carry Out the Patrol for Main Force's Route",
        "desc": "จมเรือดำน้ำน้ำลึก 6 ลำ"
    },
    "158": {
        "code": "SN04",
        "name": "Assign the Murata Squadron Torpedo Bomber to Akagi",
        "desc": "บรรจุ Akagi เป็นเรือเลขา แล้วใส่ Type 97 Torpedo Bomber (Murata Squadron)"
    },
    "282": {
        "code": "SN05",
        "name": "Snatch Away the Air Superiority in the Solomon Sea Area",
        "desc": "ผ่าน E4"
    },
    "159": {
        "code": "SN06",
        "name": "Reassign the Murata Squadron Torpedo Bomber to Shoukaku",
        "desc": "บรรจุ Shoukaku เป็นเรือเลขา แล้วใส่ Type 97 Torpedo Bomber (Murata Squadron)"
    },
    "310": {
        "code": "SN07",
        "name": "Naval Practice in Preparation for Operation FS",
        "desc": "ชนะการซ้อมรบ 4 ครั้ง"
    },
    "621": {
        "code": "SN08",
        "name": "การแปลงโมเดล 「บรรจุ Tenzan ในกองบิน Murata」",
        "desc": "บรรจุ Shoukaku เป็นเรือเลขา แล้วใส่ Type 97 Torpedo Bomber (Murata Squadron), จากนั้นทุบ Tenzan 2 ลำ"
    },
    "160": {
        "code": "SN09",
        "name": "Organize the Third Fleet of the Carrier Task Force",
        "desc": "จัดกองเรือผสมคิโดบุไต (Carrier Task Force) ที่มี Shoukaku, Zuikaku และ Zuihou ในกองเรือหลัก"
    },
    "284": {
        "code": "SN10",
        "name": "Establish  Bridgehead to Operation FS",
        "desc": "จมเรือบรรทุกเครื่องบินน้ำลึก 10 ลำ (CV)(AV)(L)"
    },
    "283": {
        "code": "SN11",
        "name": "Eastern Area Dispatch Fleet, Sortie!",
        "desc": "ผ่าน E5"
    }
    
}
